perf/proxy-9091/node-scaled/spike/spike.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Linear
      duration: 20
      arrivalRate: 5
      rampTo: 10
    - name: Stop-1
      duration: 60
      arrivalRate: 10
    - name: Spike
      duration: 5
      arrivalRate: 60
    - name: Stop-2
      duration: 60
      arrivalRate: 10
    - name: down
      duration: 30
      arrivalRate: 5

scenarios:      
  - name: Bbox2 (/)
    flow:
      - get:
          url: '/proxy-9091'